//Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя)
Console.WriteLine("Введите первое число:");
int FirstValue = Convert.ToInt32(Console.ReadLine());
Console.WriteLine((int)(FirstValue * FirstValue));